#### CategoryType Enumeration

---

|  |
| --- |
| See Also |

The type of category.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  **Since:**  2015
  **Since:**  2015

# Syntax

| C# |
| --- |
| ``` public enum CategoryType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration CategoryType ``` |

| Visual C++ |
| --- |
| ``` public enum class CategoryType ``` |

# Members

| Member name | Description |
| --- | --- |
| Invalid | The category type is invalid. |
| Model | A model element category. |
| Annotation | An annotation element category. |
| Internal | The category is for internal usage. |
| AnalyticalModel | An analytical model element category. |

# See Also

Autodesk.Revit.DB Namespace